{
  // GLG Bot - v1.8.7 - GMX Leverage Grid Bot

  // Automated grid trading bot that takes advantage of leverage on the GMX trading website.
  // - Each buy order rounds the average buy price to lower the sell price needed for the desired profit percentage.
  // - Price movement needed for the desired profit is cut down by the leverage, enabling the use of higher percentage with less market movement needed.
  // - Any suggestions or ideas are welcome ;)


  // Once the bot runs, this comments will be erased due to the JSON nature, 
  // in case you forget what any variable mean, feel free to download this file again

  // Price percentage the grid will cover
  "RATE_COVER": 7,

  // Time between each check of the bot (in minutes)
  "INTERVAL_OF_CHECKS": 3,

  // How much orders you want to have in the grid
  "TOTAL_ORDERS": 3,

  // Indentation of first order under the current price (-0.1 for instant first buy)
  "FIRST_ORDER_INDENT": -0.1,

  // How much profit you want to have before cosing the position each cycle (Price must move profit_percent/leverage before closing the position)
  "PROFIT_PERCENT": 15,

  // Amount of collateral token for each order
  "AMOUNT_IN_COLLATERAL": 10,

  // How much leverage do you want to use (max 50)
  "LEVERAGE": 20,

  // Use RSI, CCI and many more indicators to perform analysis and decide whether to buy before every cycle (True or False)
  "USE_INDICATORS": false,

  // Token to be used as collateral, can be: DAI, USDC, USDT (for Arbitrum) and: USDC, USDC.e (for Avax)
  "COLLATERAL_TOKEN": "DAI", 

  // Token in which you will open position, can be: WETH, WBTC, LINK, UNI (for Arbitrum) and: WAVAX, WBTC.e, BTC.b, WETH.e (for Avax)
  "POSITION_TOKEN": "WETH", 

  // Chain, can be Arbitrum or Avax
  "CHAIN": "Arbitrum", 

  // Technical Variables (Do not touch most of the time)
  // Number of orders bought, for fresh start or restart (you manually cancelled a position), set it to 0
  "con": 0,
  // Slippage in the case that swap is needed (better to leave at 0.1 most of the time)
  "sl": 0.1,
  // Update period handler (set automatically after first run)
  "uph": 0
}